spec/fixtures/import_file_attachments_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <bm:userInfo xmlns:bm="urn:soap.bigmachines.com">
      <bm:sessionId>82CAAC6A7EE8DBBE4C30931F3B4A88A6</bm:sessionId>
    </bm:userInfo>
    <bm:category xmlns:bm="urn:soap.bigmachines.com">Commerce</bm:category>
    <bm:xsdInfo xmlns:bm="urn:soap.bigmachines.com">
      <bm:schemaLocation>https://newtempge.bigmachines.com/bmfsweb/newtempge/schema/v1_0/commerce/quotes_process_bmClone_16.xsd</bm:schemaLocation>
    </bm:xsdInfo>
  </soapenv:Header>
  <soapenv:Body>
    <bm:importFileAttachments xmlns:bm="urn:soap.bigmachines.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <bm:mode>update</bm:mode>
      <bm:attachments>
        <bm:attachment>
          <bm:document_number/>
          <bm:variable_name/>
          <bm:filename/>
          <bm:file_content/>
        </bm:attachment>
      </bm:attachments>
      <bm:transaction>
        <bm:process_var_name>quotes_process_bmClone_16</bm:process_var_name>
        <bm:id/>
      </bm:transaction>
    </bm:importFileAttachments>
  </soapenv:Body>
</soapenv:Envelope>